@thumb
	push	{lr}
	ldr	r0, =$08000000		;空き領域
	ldr	r1, =$0202bcec		;章読みこみ用のメモリアドレス
	ldrb	r1, [r1, #14]	;現在章(マップID)ロード
	lsl	r1, r1, #2			;[0x00]なら0x00,[0x01]なら0x04
	ldr	r0, [r0, r1]		;[0x00]なら08000000,[0x01]なら08000004
	mov	r1, #1
ldr	r3, =$0800d340
mov	lr, r3
@dcw	$F800
	mov	r0, #23
	pop	{pc}
	
;
;おまけ　元となった「中断」の処理（一部省略）
;
;0002259c b500     	push	{lr}
;0002259e 1c02     	mov	r2, r0
;（中略）
;000225a8 f098 f98a	bl	$000ba8c0
;
;	000ba8c0 b500     	push	{lr}
;	000ba8c2 f752 febd	bl	$0000d640
;
;		0000d640 b500     	push	{lr}
;		0000d642 4803     	ldr	r0, [pc, #12]	($0000d650);r0に発生させたいイベントの先頭アドレス
;		0000d644 2101     	mov	r1, #1		;r0=$085b9e9c
;		0000d646 f7ff fe7b	bl	$0000d340
;		0000d64a bc01     	pop	{r0}
;		0000d64c 4700     	bx	r0
;		0000d64e 0000
;		0000d650 9e9c 085b	;「中断」で発生させるイベントの先頭アドレス
;
;
;	000ba8c6 bc01     	pop	{r0}
;	000ba8c8 4700     	bx	r0
;
;
;000225ac 2017     	mov	r0, #23
;000225ae e004     	b	$000225ba
;
;000225ba bc02     	pop	{r1}
;000225bc 4708     	bx	r1